%% 作业11-6 （沈维道. 工程热力学，第4版）
clear;
syms T;
%% 带回热理想空气制冷循环：1-2-3-4-5-6-1
kappa = 1.4; cp = 1.005;
% 过程2-3为可逆绝热压缩，已知增压比为5，环境温度为300 K，即
pi = 5; T3 = 300;
T2 = T3*pi^((1-kappa)/kappa);
% 过程5-6为可逆绝热压缩，已知增压比为5，冷库温度为273.15-40 K，即
T6 = 273.15-180;
T5 = T6*pi^(-(1-kappa)/kappa);
% 循环净功耗为
q345 = cp*(T5-T3); q612 = cp*(T2-T6);
w = q345+q612;
COP = 1/(pi^((kappa-1)/kappa)-1);
qc = -w*COP;
%% 无回热理想空气制冷循环：1-3'-5'-6-1
% 放热过程3'-5'为可逆等压过程
T3a = T3; T5a = T2;
q0 = cp*(T5a-T3a);
% 过程6-1为可逆等压吸热，吸热量为
qc_wor = w-q0;
T1 = T6+qc_wor/cp;
% 增压比为
pi_wor = (T3a/T1)^(kappa/(kappa-1));
