%% 例题：一个带安全泄压阀的0.15m3的刚性气瓶。已知初始瓶内装有0.15MPa、25°C的空气，安全阀设定压力为0.6MPa，试求对气瓶加热到250 °C 需要的热量？
%
% by Dr. Guan Guoqiang @ SCUT on 2021-03-19

%% 加热过程分成两个可逆过程（1）定容加热（2）等压加热
% 程序求解变量定义
syms p v T
% 系统参数
V = 0.15; % 气瓶体积，单位：m3
% 工质物性
cp = 1.004; cv = 0.785; Rg = cp-cv; % 单位：kJ/kg-K

%% 状态1参数
p1 = 0.15e6; % 单位：Pa（下同）
T1 = 273.15+25; % 单位：K（下同）
v1 = eval(subs(solve(p*v == Rg*T,v),[p T],[p1 T1]));
% 求得初始气瓶中工质的质量
m1 = V/v1;

%% 状态2参数
p2 = 0.6e6;
T2 = p2/p1*T1;
v2 = eval(subs(solve(p*v == Rg*T,v),[p T],[p2 T2]));
% 求得定容加热的吸热量
du1 = cv*(T2-T1);
w1 = 0; % 闭口系刚性气瓶
q1 = du1+w1; 
Q(1) = m1*q1;

%% 状态3参数
p3 = p2;
T3 = 273.15+250;
v3 = eval(subs(solve(p*v == Rg*T,v),[p T],[p3 T3]));
% 对原有气瓶中的气体建立闭口系
m2 = m1;
w2 = p3*(v3-v2); % 工质克服外力做功
du2 = cv*(T3-T2);
% 求得等压加热的吸热量
q2 = du2+w2;
Q(2) = m2*q2;

%% 输出
fprintf('过程吸热量为：%.3ekJ\n',sum(Q))