%% 计算题3-2
% 一台活塞式压气机采用两级压缩、级间冷却工艺，生产能力为压缩空气20m3/h。已知进口温度和压力分别为25°C和0.1MPa、过程增压比为4，假定级间充分冷却且各级压缩经历可逆多变压缩（n = 1.25）。求（1）最佳中间压力，（2）压气机总功耗，（3）中冷器放热量，（4）定温压缩效率

%% 初始化
clear
syms p v T
% 已知条件
qv = 30/3600; % [m3/s]
pi = 4; % 增压比
n = 1.25; % 多变指数
% 工质性质
Rg = 0.287; cp = 1.004; % [kJ/kg-K]
cv = cp-Rg;

%% 一次压缩过程
% 初态
p1 = 100; % [kPa]
T1 = 25+273.15; % [K]
v1 = Rg*T1/p1; % [m3/kg]
% 终态
p2 = pi*p1;
v2 = (p1/p2)^(1/n)*v1;
T2 = p2*v2/Rg;
% 功耗
w = eval(int((p1/p)^(1/n)*v1,p1,p2));

%% 两级压缩、级间冷却过程功耗
% 各级最佳增压比
pim = sqrt(pi);
% 第1级出口
pm = p1*pim; % 等于第2级进口压力
vm1 = (p1/pm)^(1/n)*v1;
Tm1 = pm*vm1/Rg;
Tm2 = T1;
vm2 = Rg*Tm2/pm; % 第2级进口比体积
% 压气机出口
v2 = (pm/p2)^(1/n)*vm2;
T2 = p2*v2/Rg;
% 中冷器放热量
Q = qv/v2*cp*(Tm2-Tm1);
% 各级功耗
w1 = eval(int((p1/p)^(1/n)*v1,p1,pm));
w2 = eval(int((pm/p)^(1/n)*vm2,pm,p2));
% 总功耗
w = w1+w2;
W = qv/v2*w;

%% 等温压缩效率
% 等温压缩的功耗
T2 = T1;
v2 = Rg*T2/p2;
wT = Rg*T2*log(pi);
WT = qv/v2*wT;
% 等温压缩效率
eta_T = wT/w;

%% 输出
fprintf('（1）最佳中间压力为%.1fkPa\n',pm)
fprintf('（2）压气机总功耗为%.4gkW\n',W)
fprintf('（3）中冷器放热量为%.4gkW\n',abs(Q))
fprintf('（4）等温压缩效率为%.2f%%\n',eta_T*100)