%% 例12-11
% Rev.0 by GGQ on 2019-6-28
%
clear;
syms t p V Rg T d;
%% 按公式(12-28)定义饱和水蒸气压的温度关联式
ps = 2/15*exp(18.5916-3991.11/(t+233.84));
% 干球温度下的水蒸气分压
pv1 = eval(subs(ps, t, 15))*0.65;
pv2 = eval(subs(ps, t, 32))*1.00;
% 根据湿度定义
d1 = 18/29*(pv1/(100-pv1));
d2 = 18/29*(pv2/(100-pv2));
% 干空气的分压
pa1 = 100-pv1;
pa2 = 100-pv2;
% 干空气的质量 [kg/s]
ma = pa1*1100/60*(pa1/100)/(273.15+15)/(8.3145/29);
% 蒸发水量 [kg/s]
qwm = ma*(d2-d1);
%% 计算湿焓
ha = 1.005*t;
hv = 2051+1.86*t;
h = ha+d*hv;
H1 = ma*eval(subs(h, [t d], [15 d1]));
H2 = ma*eval(subs(h, [t d], [32 d2]));
% 计算水量
qw = (H2-H1)/(4.18*(38-17));